import os

def check_file(file_path: str, mode: str) -> str:
    if not os.path.exists(file_path):
        return "❌ Файл не найден."

    size = os.path.getsize(file_path)
    if size == 0:
        return "⚠️ Файл пустой."

    # Пока что всё бесплатно, без ограничений
    allowed_ext = [
        ".txt", ".pdf", ".jpg", ".png", ".py",
        ".exe", ".scr", ".bat", ".js",
        ".jar", ".vbs", ".msi", ".docm", ".xlsm"
    ]

    if not any(file_path.endswith(ext) for ext in allowed_ext):
        return "⚠️ Недопустимый формат файла."

    if mode == "lite":
        return "⚡ Lite Scan: Быстрое сканирование выполнено. ⚠️ Внимание: скорость высокая, но качество низкое."
    elif mode == "deep":
        return "🔍 Deep Scan: Проверка выполнена. Результат неплохой, но можно было бы и лучше."
    elif mode == "basic":
        return "🛡️ Basic Defense: Расширенная защита активна. Файл проверен."
    elif mode == "pro":
        return "🛡️ Pro Shield: Максимальная защита активна. Файл проверен."
    else:
        return "❌ Неизвестный режим."